---
type: TransactionAttribute
namespace: Autodesk.Revit.Attributes
version: 2024
members: 2
tags: [revit-api, class]
---

# TransactionAttribute

`Autodesk.Revit.Attributes.TransactionAttribute` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TransactionAttribute | 2011 | `public TransactionAttribute ( TransactionMode mode )` |
| Property | Mode | 2011 | `public TransactionMode Mode { get ; }` |